{
  "HELLO": "Hello World",
  "INTRO": "I`m Andrei Buha",
  "KONTAKT": "Get in Touch",
  "AboutMe-Ask": "Who`s Andrei?",
  "AboutMe-Title": "About Me",
  "AT-I": "I'm Andrei Buha.",
  "AT-M": "My passion for programming started in childhood, when I created game servers. Though I didn't realize it back then, coding has always been my true calling. In 2024, after exploring other fields, I chose to fully dedicate myself to software development.I'm driven by the challenge of finding clean, efficient solutions and learning something new every day.",
  "AT-C": "Let's build something great together!",
  "ABtn": "Let's talk",
  "AboutMe-Location": "Based in Schrozberg",
  "AboutMe-Remote": "Open to relocate",  
  "AboutMe-Relocate": "Open to work remote",

  "Skills-Intro": "MY STACK",
  "Skills-Titile": "Skill set",
  "Skills-Message": "Experienced in JavaScript and Angular, I enjoy building dynamic and responsive user interfaces. Passionate about learning, I’m always exploring new front-end tools and frameworks to stay current and deliver efficient, modern web applications that scale well.",
  "Skills-Pull": "Pull to peel",
  "Skills-Future": "Also, I'm interested in diving into: ",

  "Projects-Intro": "MY CRAFT",
  "Projects-Title": "Projects",
  "Projects-Message": "Explore my projects — crafted with responsive design, intuitive interfaces, and clean, efficient code. Click through and see them in action!",
  "Projects-Btn": "Project details",
  "projects": {
    "description": "Description",
    "implementation": "Implementation Details",
    "duration": "Duration",
    "weks": "weeks",
    "join": {
      "description": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
      "implementation": "I worked for one month on this project as part of a 3-person team. It was a new and challenging experience to collaborate closely with others, but also very rewarding. We used Jira to manage tasks and track our progress, which helped keep the workflow organized and efficient. This project taught me a lot about teamwork, communication, and working within a structured development process."
    },
    "elPolloLoco": {
      "description": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.",
      "implementation": "This was my first game developed using JavaScript. It’s a platformer where the main character, Pepe, collects coins and Tabasco salsa to fight a crazy hen. I used the HTML5 canvas for rendering and followed an object-oriented programming (OOP) approach using classes and objects. Through this project, I learned the basics of game development, including animation, collision detection, and structuring code with OOP. It inspired me to continue learning and eventually build more complex games in the future. "
    },
    "dabubble": {
      "description": "This App is a Slack Clone App. It revolutionizes team communication and collaboration with its intuitive interface, real-time messaging, and robust channel organization.",
      "implementation": "Next, I will build DaBubble, a chat app similar to Slack. This project will help me develop skills in real-time communication, user authentication, and collaborative features, improving my full-stack development abilities."
    }
  },
  "Testimonial-Intro": "IN THEIR WORDS:",
  "Testimonial-Title": "Colleagues' Thoughts",

  "Footer-Intro": "Contact Me",
  "Footer-Title": "Ready to work together?",
  "Footer-Message": "Feel free to contact me if you are looking for a dedicated web developer. With my expertise and willingness to learn, I aim to support your team effectively. I look forward to applying my skills to new projects and achieving goals together. Let’s discuss how I can add value for you.",

  "contact": {
    "name": "What's your name?",
    "namePlaceholder": "Your name goes here",
    "nameError": "Oops! It seems your name is missing",
    "email": "What's your email?",
    "emailPlaceholder": "youremail@email.com",
    "emailError": "Hoppla! your email is required",
    "text": "How can I help you ?",
    "textPlaceholder": "Your text",
    "textError": "What do you need to develop?"
  },
  "ContactFrom-First":"I've read the ",
  "ContactForm-Second":"privacy policy",
  "ContactForm-Third":"and agree to the processing of my data as outlined.",
  "ContactForm-Error": "You must agree to the terms and conditions",
  "ContactForm-Btn": "Submit",

  "ProjectsListBtnGoBack": "Go Back",
  "ProjectsListBtnNextProject": "Next Project ",

  "Navigation": {
    "AboutMe": "About Me",
    "Skills": "Skills",
    "Projects": "Projects",
    "Contact": "Contact"
  }
}